
//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CRC8_H
#define CRC8_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Вычисление контрольной суммы.
/// \param crc  - начальное значение CRC8;
/// \param data - указатель на массив данных;
/// \param len  - длина массива данных.
/// \return Значение контрольной суммы.
/// \note В качестве алгоритма вычисления контрольной суммы
/// используется CRC8, с начальным значением crc и полиномом \f$x^8 + x^7 + x^2 + 1\f$.
///
uint8_t crc8_update( uint8_t crc, const uint8_t *data, uint8_t len );

#endif 